# Execute Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IDropHandler..::..Execute Method
IDropHandler Interface See Also
---
Implement this method to handle the drop event for your data.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
void Execute(
	UIDocument document,
	Object data
)
```

Visual Basic
---
```text
Sub Execute ( _
	document As UIDocument, _
	data As Object _
)
```

Visual C++
---
```text
void Execute(
	UIDocument^ document,
	Object^ data
)
```

# ### Parameters
document
    Type: Autodesk.Revit.UI..::..UIDocumentThe document on which the data was dropped.
data
    Type: System..::..ObjectThe data.
# See Also
IDropHandler Interface
Autodesk.Revit.UI Namespace